Documents/СведенияОНезачисленнойЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СведенияОНезачисленнойЗарплате</Name>
			<Comment>АПК:93 представления объекта и списка совпадают</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛПеречисленный</xr:Item>
				<xr:Item>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиАкционерами</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛКПеречислению</xr:Item>
				<xr:Item>AccumulationRegister.ЗарплатаКВыплатеАвансом</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.СведенияОДоходахНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.ЗарплатаКВыплате</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСБюджетомПоНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыПеречислением</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьПрочихДоходовВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьПрочихДоходовПеречислением</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58 физлицо является сотрудником</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СведенияОНезачисленнойЗарплате/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ЗУПК
    Если ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением")
        ИЛИ ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
		ПроверятьЗарплатныйПроект = Ложь;
	Иначе
	// ЗУПК
	ПроверятьЗарплатныйПроект = ОбменСБанкамиПоЗарплатнымПроектам.ЭтоВедомостьВБанк(Ведомость);
	// ЗУПК
	КонецЕсли;
	// ЗУПК
	
	ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомость, "Проведен, Организация" + ?(ПроверятьЗарплатныйПроект, ", ЗарплатныйПроект", ""));
	
	ПроверятьЗарплатныйПроект = ПроверятьЗарплатныйПроект И ЗначениеЗаполнено(ДанныеВедомости.ЗарплатныйПроект);
	
	Если НЕ Ведомость.Проведен Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 не проведен.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	Если ДанныеВедомости.Организация <> Организация Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 относится к другой организации.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	СведенияОНезачисленнойЗарплатеПоВедомости = Документы.СведенияОНезачисленнойЗарплате.ВыбратьПоВедомости(Ведомость, Истина);
	Если СведенияОНезачисленнойЗарплатеПоВедомости.Количество() <> 0 
		И (СведенияОНезачисленнойЗарплатеПоВедомости.Количество() > 1 ИЛИ СведенияОНезачисленнойЗарплатеПоВедомости[0] <> Ссылка) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По документу %1 уже введены сведения о незачисленной зарплате.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	// ЗУПК
	// Если в документе выбран сотрудник, которого нет в указанной ведомости, необходимо выдавать предупреждение
	РезультатПроверки = ПроверитьСоответствиеСотрудниковВедомости();
	Если Не РезультатПроверки Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В таблице есть сотрудники, отсутствующие в документе %1.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	// ЗУПК
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Физлица = Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если Не Отказ И Физлица.Количество() > 0 Тогда
		
		// Отключение контроля соответствия начислений и выплат 
		// Регистрация незачисленной зарплаты не является ни начислением, ни выплатой.
		// Это своего рода сторнирующий документ: выплата не удалась, возвращаем сумму в зарплату к выплате.
		// Поэтому проверка тут не нужна
		КонтрольСоответствияНачисленийИВыплат.Отключить(Движения);
		
		// Взаиморасчеты
		Если ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк")
			Или ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ВзаиморасчетыПоПрочимДоходам.ЗарегистрироватьНевыплатуПоВедомостиПрочихДоходов(Движения, Отказ, Ведомость, Физлица);
		Иначе
			ВзаиморасчетыССотрудниками.ЗарегистрироватьНевыплатуПоВедомости(Движения, Отказ, Ведомость, Физлица);
		КонецЕсли;
		
		// НДФЛ
		УчетНДФЛ.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		УчетФактическиПолученныхДоходовРасширенный.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// ЗУПК
Функция ПроверитьСоответствиеСотрудниковВедомости()
	
	//Получаем список сотрудников в первоначальном документе
	СотрудникиПоВедомости = Новый Массив();
	Для Каждого ДанныеСтроки Из Ведомость.Состав Цикл
		СотрудникиПоВедомости.Добавить(ДанныеСтроки.ФизическоеЛицо);
	КонецЦикла;
	
	//Проверяем наличие каждого сотрудника из текущего документа в ведомости
	ВсеСотрудникиСоответствуют = Истина;
	Для Каждого Сотрудник Из ЭтотОбъект.Сотрудники Цикл
		Если СотрудникиПоВедомости.Найти(Сотрудник.ФизическоеЛицо) = Неопределено Тогда
			ВсеСотрудникиСоответствуют = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеСотрудникиСоответствуют;
	
КонецФункции
// ЗУПК

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
